[
    {
        "id": 1,
        "title": "2025 Intern, NLP and ML Research",
        "original_url": "https://pairwise.com",
        "company": "Samsung Research America",
        "location": "Mountain View, CA",
        "status": "Archived",
        "description": "About the Job\r\nSamsung Research AI center, located in Mountain View, CA, is currently recruiting world-class students who can thrive in a fast-pace, cross team, results-driven environment, with focus on highly visible, challenging, and cross discipline projects. You will be part of an exciting project to build an adaptive, personalized, contextual and secure AI model and system to enable fast, accurate and safe interactions tailored to users’ needs on Samsung devices.\r\nJob Responsibilities\r\nDevelop and implement novel deep learning/reinforcement learning algorithms for natural language processing (text, speech) in various applications\r\nContribute to the research activities of our team\r\nGenerate creative solutions (patents) and publish in top conferences (papers)\r\nRequirements\r\nTeamwork and communication skills\r\nCurrent Ph.D. student in CS, EE, or related field\r\nExperience in one or more of the following areas:\r\nStrong background in machine learning (supervised learning, transfer learning, one-shot or few shot learning, unsupervised learning, semi-supervised learning, weakly supervised learning, meta-learning, outlier detection, etc.)\r\nExpertise in LLM including model architecture, training/finetuning techniques, retrieval augmented generation (RAG), reasoning and action planning, etc.\r\nExperience in conversational AI technologies: natural language processing (e.g., language models, semantic parsing, natural language generation etc.), dialogue (e.g., state tracking, policy learning), and representation learning (embedding, conceptualization, etc.)\r\nExperience in knowledge augmented AI technologies (e.g., language prompt, knowledge graph, neuro-symbolic learning)\r\nExperience in agentic AI is a plus.\r\nExperience in multimodal AI technologies for various multimodal applications.\r\nExperience in on-device AI technologies such as lightweight model architecture design.\r\nProficiency in a neural network library (e.g., PyTorch, TensorFlow).\r\nProven track record of research/publications on machine learning and artificial intelligence field (NeurIPS, ICML, ICLR, AAAI, IJCAI, CVPR, ACL, EMNLP, NAACL, TACL, etc.)",
        "resume_used": "",
        "date_saved": "2025-02-23 00:46:17",
        "last_update": "2025-02-23 00:47:02"
    },
    {
        "id": 2,
        "title": "Intern, Machine Learning",
        "original_url": "https://pairwise.com",
        "company": "Pairwise",
        "location": "Durham, NC",
        "status": "Applied",
        "description": "About the Job\r\nWe are seeking passionate, engaging, ready-to-learn interns to join us for Summer 2025. We are looking for interns with majors in: Machine Learning/AI, Software Engineering, Biology, Molecular Biology, Genomics, Statistics, Plant Science, Botany, Food Science, Marketing, or Facilities Management. Pairwise offers the opportunity of getting to work with industry leading scientists and professionals in a cutting edge, industry changing, food+tech company. Our interns will be integrated with our teams here at Pairwise to allow for hands on learning in a fast-paced start-up environment. Interns will also have season long cap-stone projects that will add real value and help the team resolve real-world challenges they are currently facing. We like to have fun at Pairwise, so the summer won’t be all work and no play! Pairwise interns will not only have “Intern Only” meeting sessions to talk about their experience and share thoughts and feedback with each other, but will also have events to help with career and educational planning, and team building trips to share in the fun of summer in North Carolina.\r\nJob Responsibilities\r\nGain familiarity with the slate of ML projects, their restrictions, and their intended outcomes\r\nDevelop familiarity with the needs and challenges of the teams requiring the ML projects\r\nIdentify, structure and customize data to be used in ML projects\r\nDevelop the relevant ML models to deliver on the project outcomes\r\nCollaborate with internal customers to modify and refine the ML models to deliver on and optimize the project outcomes\r\nRequirements\r\nA student currently enrolled in a Masters or PhD program in one of the following disciplines: Machine Learning/AI, Software Engineering, or Statistics, with experience in Molecular Genetics, Plant Science, or Botany strongly preferred.\r\nProficiency in developing Machine Learning models is essential",
        "resume_used": "",
        "date_saved": "2025-02-23 00:48:12",
        "last_update": "2025-02-23 00:48:12"
    },
    {
        "id": 3,
        "title": "Summer 2025 Internship Program",
        "original_url": "https://Etched.com",
        "company": "Etched",
        "location": "cupertino, CA",
        "status": "Archived",
        "description": "About the Job\r\nInterns will get to work on cutting-edge engineering and business challenges across the following departments at Etched:\r\nJob Responsibilities\r\nHelp us design and verify our next-gen silicon.\r\nHelp solve novel challenges in microarchitecture design to drive unprecedented FLOPS on our chip.\r\nJoin the Platform team and help us build state-of-the-art systems at scale.\r\nBuild firmware, inference engines, and model infrastructure for Sohu.\r\nHelp accelerate our go-to-market engine.\r\nBuild relationships and source top talent.\r\nRequirements\r\nExcellent electrical and computer engineers for Hardware Engineering.\r\nExceptional electrical and mechanical engineers for Platform Engineering.\r\nLeading SWEs and machine learning researchers across a variety of roles.\r\nSharp, ambitious interns who can thrive under pressure for Operations.\r\nTalented customer-facing interns for Go-to-Market.\r\nTechnical recruiting interns for Talent Acquisition.",
        "resume_used": "",
        "date_saved": "2025-02-23 00:49:04",
        "last_update": "2025-02-23 01:53:45"
    },
    {
        "id": 4,
        "title": "Experimental Physicist - AI Trainer",
        "original_url": "",
        "company": "Outlier Ai",
        "location": "VB",
        "status": "Bookmarked",
        "description": "Full job description\nOutlier helps the world’s most innovative companies improve their AI models by providing human feedback. Are you an experienced physics who would like to lend your expertise to train AI models?\n\n\nAbout the opportunity:\n\nOutlier is looking for talented Physics experts to help train generative artificial intelligence models\nThis freelance opportunity is remote and hours are flexible, so you can work whenever is best for you\nYou may contribute your expertise by…\n\nAssessing the factuality and relevance of domain-specific text produced by AI models\nCrafting and answering questions related to physics\nEvaluating and ranking domain-specific responses generated by AI models\n\nExamples of desirable expertise:\n\nA bachelor's or higher degree in physics or a related subject\nExperience working as an physics professional\nAbility to write clearly about concepts related to physics in fluent English\n\nPayment:\n\nCurrently, pay rates for core project work by physics experts range from $30 to $50 per hour USD.\nRates vary based on expertise, skills assessment, location, project need, and other factors. For example, higher rates may be offered to PhDs. For non-core work, such as during initial project onboarding or project overtime phases, lower rates may apply. Certain projects offer incentive payments. Please review the payment terms for each project.\n\nPLEASE NOTE: We collect, retain and use personal data for our professional business purposes, including notifying you of opportunities that may be of interest and sharing with our affiliates. We limit the personal data we collect to that which we believe is appropriate and necessary to manage applicants’ needs, provide our services, and comply with applicable laws. Any information we collect in connection with your application will be treated in accordance with the Outlier Privacy Policy and our internal policies and programs designed to protect personal data.\n\nThis is a 1099 contract opportunity on the Outlier.ai platform. Because this is a freelance opportunity, we do not offer internships, sponsorship, or employment. You must be authorized to work in your country of residence. If you are an international student, you may be able to sign up for Outlier if you are on a visa. You should contact your tax and/or immigration advisor with specific questions regarding your circumstances",
        "resume_used": "",
        "date_saved": "2025-02-23 02:25:26",
        "last_update": "2025-02-23 02:25:26"
    },
    {
        "id": 5,
        "title": "Quantitative Analyst Masters Degree or PHD - AI Trainer",
        "original_url": "",
        "company": "Outlier Ai",
        "location": "VB",
        "status": "Bookmarked",
        "description": "Full job description\nOutlier helps the world’s most innovative companies improve their AI models by providing human feedback. Are you an experienced Math Expert who would like to lend your expertise to train AI models? About the opportunity: Outlier is looking for talented Math Experts to help train generative artificial intelligence modelsThis freelance opportunity is remote and hours are flexible, so you can work whenever is best for youYou may contribute your expertise by… Assessing the factuality and relevance of domain-specific text produced by AI modelsCrafting and answering questions related to MathEvaluating and ranking domain-specific responses generated by AI models Examples of desirable expertise: A Bachelor's or higher degree in Math or a related subject (Statistics, Economics, Finance, Actuary, Data Analytics)Experience working as a Math professionalAbility to write clearly about concepts related to Math in fluent EnglishPayment: Currently, pay rates for core project work by Math experts range from $30 to $50 per hour USD. Rates vary based on expertise, skills assessment, location, project need, and other factors.\n\nFor example, higher rates may be offered to PhDs. For non-core work, such as during initial project onboarding or project overtime phases, lower rates may apply. Certain projects offer incentive payments. Please review the payment terms for each project.",
        "resume_used": "",
        "date_saved": "2025-02-23 02:51:23",
        "last_update": "2025-02-23 02:51:23"
    },
    {
        "id": 6,
        "title": "Senior Software Engineer",
        "original_url": "",
        "company": "DKW Communications",
        "location": "Norfolk, VA",
        "status": "Bookmarked",
        "description": "Certifications\n\nCompTIA Security+\n\nDo you have a valid CompTIA Security+ certification?\nSkills\n\nSoftware development\n (Required)\n\nRHEL\n (Required)\n\nC#\n (Required)\n+ show more\n\nDo you have experience in Software development?\nEducation\n\nBachelor's degree\n (Required)\n&nbsp;\nJob details\nHere’s how the job details align with your profile.\nJob type\n\nFull-time\nShift and schedule\n\nMonday to Friday\n&nbsp;\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\n&nbsp;\nFull job description\nCome Join Our Team! DKW Communications, Inc. (DKW) is a government contractor providing professional and technical services to various government agencies i.e. defense, law enforcement and security. We are currently looking for a_ Senior Software Engineer _to join our winning team. This position is primarily on site in Norfolk, VA with minimal telework.\n\nPrimary Duties and Responsibilities:\n\nPerforms the work necessary to design, develop, document, test, integrate, and modify operating systems and application software for aviation training systems\nDevelops, creates, troubleshoots, and modifies specialized utility programs and applications in support of real-time systems\nPerforms hardware and software development planning in the incorporation of hardware and software modifications into aviation training systems\nDevelops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle\nDetermines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions\nDocuments and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code\nHelps to lead other junior S/W engineers to perform and assist in duties.\nQualifications/Requirements\n\n· Active Secret security clearance or higher\n\n· Bachelor’s degree in electronics or computer engineering, computer science, or equivalent\n\n· A minimum of five years of practical experience in software development associated with modeling and simulation within the training systems domains is required\n\n· Demonstrated experience with Microsoft Windows and various Unix flavors, such as Linux\n\n· At least one year of cyber security experience is a string plus\n\n· Familiar with software development and diagnostic tools\n\n· CompTIA Security+ CE preferred; if not held, certification must be obtained within six months of date of hire\n\nDesired Programming Languages: C, C++; Microsoft .Net (C#, VB); Java\nDesired Environments/Applications/Utilities: Visual Studio 2012 or later, SVN, Subversion, TortoiseSVN, PostgreSQL, PowerShell, Bash, RPM\nDesired Operating Systems: Windows 7/10, Windows Server 2008R2/2012R2/2016R2, Red Hat Enterprise Linux 5,6,7\n\n**All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.**\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nRelocation assistance\nTuition reimbursement\nVision insurance\nCompensation Package:\n\nSigning bonus\nSchedule:\n\nMonday to Friday\nEducation:\n\nBachelor's (Required)\nExperience:\n\nsoftware engineer: 4 years (Required)\nSecurity clearance:\n\nSecret (Required)\nAbility to Commute:\n\nNorfolk, VA 23511 (Required)\nWork Location: In person",
        "resume_used": "",
        "date_saved": "2025-02-23 03:02:51",
        "last_update": "2025-02-23 03:02:51"
    },
    {
        "id": 7,
        "title": "Senior Software Engineer",
        "original_url": "",
        "company": "DKW Communications",
        "location": "Norfolk, VA",
        "status": "Bookmarked",
        "description": "Certifications\n\nCompTIA Security+\n\nDo you have a valid CompTIA Security+ certification?\nSkills\n\nSoftware development\n (Required)\n\nRHEL\n (Required)\n\nC#\n (Required)\n+ show more\n\nDo you have experience in Software development?\nEducation\n\nBachelor's degree\n (Required)\n&nbsp;\nJob details\nHere’s how the job details align with your profile.\nJob type\n\nFull-time\nShift and schedule\n\nMonday to Friday\n&nbsp;\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\n&nbsp;\nFull job description\nCome Join Our Team! DKW Communications, Inc. (DKW) is a government contractor providing professional and technical services to various government agencies i.e. defense, law enforcement and security. We are currently looking for a_ Senior Software Engineer _to join our winning team. This position is primarily on site in Norfolk, VA with minimal telework.\n\nPrimary Duties and Responsibilities:\n\nPerforms the work necessary to design, develop, document, test, integrate, and modify operating systems and application software for aviation training systems\nDevelops, creates, troubleshoots, and modifies specialized utility programs and applications in support of real-time systems\nPerforms hardware and software development planning in the incorporation of hardware and software modifications into aviation training systems\nDevelops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle\nDetermines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions\nDocuments and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code\nHelps to lead other junior S/W engineers to perform and assist in duties.\nQualifications/Requirements\n\n· Active Secret security clearance or higher\n\n· Bachelor’s degree in electronics or computer engineering, computer science, or equivalent\n\n· A minimum of five years of practical experience in software development associated with modeling and simulation within the training systems domains is required\n\n· Demonstrated experience with Microsoft Windows and various Unix flavors, such as Linux\n\n· At least one year of cyber security experience is a string plus\n\n· Familiar with software development and diagnostic tools\n\n· CompTIA Security+ CE preferred; if not held, certification must be obtained within six months of date of hire\n\nDesired Programming Languages: C, C++; Microsoft .Net (C#, VB); Java\nDesired Environments/Applications/Utilities: Visual Studio 2012 or later, SVN, Subversion, TortoiseSVN, PostgreSQL, PowerShell, Bash, RPM\nDesired Operating Systems: Windows 7/10, Windows Server 2008R2/2012R2/2016R2, Red Hat Enterprise Linux 5,6,7\n\n**All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.**\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nRelocation assistance\nTuition reimbursement\nVision insurance\nCompensation Package:\n\nSigning bonus\nSchedule:\n\nMonday to Friday\nEducation:\n\nBachelor's (Required)\nExperience:\n\nsoftware engineer: 4 years (Required)\nSecurity clearance:\n\nSecret (Required)\nAbility to Commute:\n\nNorfolk, VA 23511 (Required)\nWork Location: In person",
        "resume_used": "",
        "date_saved": "2025-02-23 03:03:19",
        "last_update": "2025-02-23 03:03:19"
    },
    {
        "id": 8,
        "title": "Senior Software Engineer",
        "original_url": "",
        "company": "DKW Communications",
        "location": "Norfolk, VA",
        "status": "Bookmarked",
        "description": "Certifications\n\nCompTIA Security+\n\nDo you have a valid CompTIA Security+ certification?\nSkills\n\nSoftware development\n (Required)\n\nRHEL\n (Required)\n\nC#\n (Required)\n+ show more\n\nDo you have experience in Software development?\nEducation\n\nBachelor's degree\n (Required)\n&nbsp;\nJob details\nHere’s how the job details align with your profile.\nJob type\n\nFull-time\nShift and schedule\n\nMonday to Friday\n&nbsp;\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\n&nbsp;\nFull job description\nCome Join Our Team! DKW Communications, Inc. (DKW) is a government contractor providing professional and technical services to various government agencies i.e. defense, law enforcement and security. We are currently looking for a_ Senior Software Engineer _to join our winning team. This position is primarily on site in Norfolk, VA with minimal telework.\n\nPrimary Duties and Responsibilities:\n\nPerforms the work necessary to design, develop, document, test, integrate, and modify operating systems and application software for aviation training systems\nDevelops, creates, troubleshoots, and modifies specialized utility programs and applications in support of real-time systems\nPerforms hardware and software development planning in the incorporation of hardware and software modifications into aviation training systems\nDevelops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle\nDetermines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions\nDocuments and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code\nHelps to lead other junior S/W engineers to perform and assist in duties.\nQualifications/Requirements\n\n· Active Secret security clearance or higher\n\n· Bachelor’s degree in electronics or computer engineering, computer science, or equivalent\n\n· A minimum of five years of practical experience in software development associated with modeling and simulation within the training systems domains is required\n\n· Demonstrated experience with Microsoft Windows and various Unix flavors, such as Linux\n\n· At least one year of cyber security experience is a string plus\n\n· Familiar with software development and diagnostic tools\n\n· CompTIA Security+ CE preferred; if not held, certification must be obtained within six months of date of hire\n\nDesired Programming Languages: C, C++; Microsoft .Net (C#, VB); Java\nDesired Environments/Applications/Utilities: Visual Studio 2012 or later, SVN, Subversion, TortoiseSVN, PostgreSQL, PowerShell, Bash, RPM\nDesired Operating Systems: Windows 7/10, Windows Server 2008R2/2012R2/2016R2, Red Hat Enterprise Linux 5,6,7\n\n**All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.**\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nRelocation assistance\nTuition reimbursement\nVision insurance\nCompensation Package:\n\nSigning bonus\nSchedule:\n\nMonday to Friday\nEducation:\n\nBachelor's (Required)\nExperience:\n\nsoftware engineer: 4 years (Required)\nSecurity clearance:\n\nSecret (Required)\nAbility to Commute:\n\nNorfolk, VA 23511 (Required)\nWork Location: In person",
        "resume_used": "",
        "date_saved": "2025-02-23 03:08:38",
        "last_update": "2025-02-23 03:08:38"
    },
    {
        "id": 9,
        "title": "Senior Software Engineer",
        "original_url": "",
        "company": "DKW Communications",
        "location": "Norfolk, VA",
        "status": "Bookmarked",
        "description": "Certifications\n\nCompTIA Security+\n\nDo you have a valid CompTIA Security+ certification?\nSkills\n\nSoftware development\n (Required)\n\nRHEL\n (Required)\n\nC#\n (Required)\n+ show more\n\nDo you have experience in Software development?\nEducation\n\nBachelor's degree\n (Required)\n&nbsp;\nJob details\nHere’s how the job details align with your profile.\nJob type\n\nFull-time\nShift and schedule\n\nMonday to Friday\n&nbsp;\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\n&nbsp;\nFull job description\nCome Join Our Team! DKW Communications, Inc. (DKW) is a government contractor providing professional and technical services to various government agencies i.e. defense, law enforcement and security. We are currently looking for a_ Senior Software Engineer _to join our winning team. This position is primarily on site in Norfolk, VA with minimal telework.\n\nPrimary Duties and Responsibilities:\n\nPerforms the work necessary to design, develop, document, test, integrate, and modify operating systems and application software for aviation training systems\nDevelops, creates, troubleshoots, and modifies specialized utility programs and applications in support of real-time systems\nPerforms hardware and software development planning in the incorporation of hardware and software modifications into aviation training systems\nDevelops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle\nDetermines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions\nDocuments and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code\nHelps to lead other junior S/W engineers to perform and assist in duties.\nQualifications/Requirements\n\n· Active Secret security clearance or higher\n\n· Bachelor’s degree in electronics or computer engineering, computer science, or equivalent\n\n· A minimum of five years of practical experience in software development associated with modeling and simulation within the training systems domains is required\n\n· Demonstrated experience with Microsoft Windows and various Unix flavors, such as Linux\n\n· At least one year of cyber security experience is a string plus\n\n· Familiar with software development and diagnostic tools\n\n· CompTIA Security+ CE preferred; if not held, certification must be obtained within six months of date of hire\n\nDesired Programming Languages: C, C++; Microsoft .Net (C#, VB); Java\nDesired Environments/Applications/Utilities: Visual Studio 2012 or later, SVN, Subversion, TortoiseSVN, PostgreSQL, PowerShell, Bash, RPM\nDesired Operating Systems: Windows 7/10, Windows Server 2008R2/2012R2/2016R2, Red Hat Enterprise Linux 5,6,7\n\n**All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.**\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nRelocation assistance\nTuition reimbursement\nVision insurance\nCompensation Package:\n\nSigning bonus\nSchedule:\n\nMonday to Friday\nEducation:\n\nBachelor's (Required)\nExperience:\n\nsoftware engineer: 4 years (Required)\nSecurity clearance:\n\nSecret (Required)\nAbility to Commute:\n\nNorfolk, VA 23511 (Required)\nWork Location: In person",
        "resume_used": "",
        "date_saved": "2025-02-23 03:08:57",
        "last_update": "2025-02-23 03:08:57"
    },
    {
        "id": 10,
        "title": "Senior Software Engineer",
        "original_url": "",
        "company": "DKW Communications",
        "location": "Norfolk, VA",
        "status": "Bookmarked",
        "description": "Certifications\n\nCompTIA Security+\n\nDo you have a valid CompTIA Security+ certification?\nSkills\n\nSoftware development\n (Required)\n\nRHEL\n (Required)\n\nC#\n (Required)\n+ show more\n\nDo you have experience in Software development?\nEducation\n\nBachelor's degree\n (Required)\n&nbsp;\nJob details\nHere’s how the job details align with your profile.\nJob type\n\nFull-time\nShift and schedule\n\nMonday to Friday\n&nbsp;\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\n&nbsp;\nFull job description\nCome Join Our Team! DKW Communications, Inc. (DKW) is a government contractor providing professional and technical services to various government agencies i.e. defense, law enforcement and security. We are currently looking for a_ Senior Software Engineer _to join our winning team. This position is primarily on site in Norfolk, VA with minimal telework.\n\nPrimary Duties and Responsibilities:\n\nPerforms the work necessary to design, develop, document, test, integrate, and modify operating systems and application software for aviation training systems\nDevelops, creates, troubleshoots, and modifies specialized utility programs and applications in support of real-time systems\nPerforms hardware and software development planning in the incorporation of hardware and software modifications into aviation training systems\nDevelops software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle\nDetermines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions\nDocuments and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code\nHelps to lead other junior S/W engineers to perform and assist in duties.\nQualifications/Requirements\n\n· Active Secret security clearance or higher\n\n· Bachelor’s degree in electronics or computer engineering, computer science, or equivalent\n\n· A minimum of five years of practical experience in software development associated with modeling and simulation within the training systems domains is required\n\n· Demonstrated experience with Microsoft Windows and various Unix flavors, such as Linux\n\n· At least one year of cyber security experience is a string plus\n\n· Familiar with software development and diagnostic tools\n\n· CompTIA Security+ CE preferred; if not held, certification must be obtained within six months of date of hire\n\nDesired Programming Languages: C, C++; Microsoft .Net (C#, VB); Java\nDesired Environments/Applications/Utilities: Visual Studio 2012 or later, SVN, Subversion, TortoiseSVN, PostgreSQL, PowerShell, Bash, RPM\nDesired Operating Systems: Windows 7/10, Windows Server 2008R2/2012R2/2016R2, Red Hat Enterprise Linux 5,6,7\n\n**All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.**\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nReferral program\nRelocation assistance\nTuition reimbursement\nVision insurance\nCompensation Package:\n\nSigning bonus\nSchedule:\n\nMonday to Friday\nEducation:\n\nBachelor's (Required)\nExperience:\n\nsoftware engineer: 4 years (Required)\nSecurity clearance:\n\nSecret (Required)\nAbility to Commute:\n\nNorfolk, VA 23511 (Required)\nWork Location: In person",
        "resume_used": "",
        "date_saved": "2025-02-23 03:09:28",
        "last_update": "2025-02-23 03:09:28"
    },
    {
        "id": 11,
        "title": "Software developer",
        "original_url": "",
        "company": "NA",
        "location": "Norfolk, VA",
        "status": "Offer",
        "description": "chrome.action.onClicked.addListener(async (tab) => {\n  if (!tab || !tab.id) return;\n  await chrome.scripting.executeScript({\n    target: { tabId: tab.id },\n    function: togglePanel\n  });\n});\n\nfunction togglePanel() {\n  const existing = document.getElementById('jobSaverContainer');\n  if (existing) {\n    existing.remove();\n    return;\n  }\n\n  // Inject styling dynamically\n  const style = document.createElement('style');\n  style.textContent = `\n    #jobSaverContainer {\n      position: fixed;\n      top: 80px;\n      right: 40px;\n      width: 400px;\n      max-height: 85vh;\n      background-color: #ffffff;\n      border: 1px solid #ddd;\n      border-radius: 10px;\n      box-shadow: 0 8px 16px rgba(0,0,0,0.2);\n      z-index: 999999;\n      overflow-y: auto;\n      padding: 20px;\n      font-family: \"Segoe UI\", Tahoma, Geneva, Verdana, sans-serif;\n    }\n    #jobSaverHeader {\n      font-size: 24px;\n      font-weight: 600;\n      margin-bottom: 20px;\n      text-align: center;\n      position: relative;\n    }\n    #jobSaverClose {\n      position: absolute;\n      top: 0;\n      right: 10px;\n      font-size: 28px;\n      cursor: pointer;\n      color: #666;\n    }\n    #jobSaverForm .form-group {\n      margin-bottom: 15px;\n    }\n    #jobSaverForm input,\n    #jobSaverForm select,\n    #jobSaverForm textarea {\n      width: 100%;\n      padding: 10px;\n      font-size: 16px;\n      border: 1px solid #ccc;\n      border-radius: 6px;\n      box-sizing: border-box;\n      margin-bottom: 8px;\n    }\n    #jobSaverForm textarea {\n      min-height: 100px;\n      resize: vertical;\n    }\n    #jobSaverForm button.save-btn {\n      width: 100%;\n      padding: 12px;\n      background-color: #0d6efd;\n      border: none;\n      color: #fff;\n      font-size: 16px;\n      border-radius: 6px;\n      cursor: pointer;\n      transition: background-color 0.3s ease;\n      font-weight: 600;\n    }\n    #jobSaverForm button.save-btn:hover {\n      background-color: #0b5ed7;\n    }\n  `;\n  document.head.appendChild(style);\n\n  // Create the container\n  const container = document.createElement('div');\n  container.id = 'jobSaverContainer';\n\n  // Create header with close button\n  const header = document.createElement('div');\n  header.id = 'jobSaverHeader';\n  header.textContent = 'Save Job';\n\n  const closeBtn = document.createElement('span');\n  closeBtn.id = 'jobSaverClose';\n  closeBtn.innerHTML = '&times;';\n  closeBtn.addEventListener('click', () => {\n    container.remove();\n    style.remove();\n  });\n  header.appendChild(closeBtn);\n  container.appendChild(header);\n\n  // Create the form\n  const form = document.createElement('form');\n  form.id = 'jobSaverForm';\n  form.innerHTML = `\n    <div class=\"form-group\">\n      <input type=\"text\" id=\"jsJobTitle\" name=\"title\" placeholder=\"Job Title\" required>\n    </div>\n    <div class=\"form-group\">\n      <input type=\"text\" id=\"jsCompany\" name=\"company\" placeholder=\"Company\" required>\n    </div>\n    <div class=\"form-group\">\n      <input type=\"text\" id=\"jsLocation\" name=\"location\" placeholder=\"Location\" required>\n    </div>\n    <div class=\"form-group\">\n      <select id=\"jsStatus\" name=\"status\" required>\n        <option value=\"\">Select Status</option>\n        <option value=\"Bookmarked\">Bookmarked</option>\n        <option value=\"Applying\">Applying</option>\n        <option value=\"Applied\">Applied</option>\n        <option value=\"Interview\">Interview</option>\n        <option value=\"Negotiation\">Negotiation</option>\n        <option value=\"Offer\">Offer</option>\n      </select>\n    </div>\n    <div class=\"form-group\">\n      <textarea id=\"jsDescription\" name=\"description\" placeholder=\"Job Description\"></textarea>\n    </div>\n    <button type=\"submit\" class=\"save-btn\">Save Job</button>\n  `;\n  container.appendChild(form);\n  document.body.appendChild(container);\n\n  // Handle form submission\n  form.addEventListener('submit', async (event) => {\n    event.preventDefault();\n    const jobData = {\n      title: document.getElementById('jsJobTitle').value.trim(),\n      company: document.getElementById('jsCompany').value.trim(),\n      location: document.getElementById('jsLocation').value.trim(),\n      status: document.getElementById('jsStatus').value,\n      description: document.getElementById('jsDescription').value.trim()\n    };\n\n    const params = new URLSearchParams(jobData);\n\n    try {\n      const response = await fetch(\"http://localhost:5000/add_job\", {\n        method: \"POST\",\n        headers: { \n          \"Content-Type\": \"application/x-www-form-urlencoded\", \n          \"Accept\": \"application/json\" \n        },\n        body: params.toString()\n      });\n\n      const result = await response.json();\n\n      if (response.ok && result.success) {\n        alert(\"Job saved successfully!\");\n        container.remove(); // ✅ Close the popup after successful save\n        style.remove();\n      } else {\n        console.error(\"Server Response Error:\", result);\n        alert(`Error: ${result.message || \"Job could not be saved.\"}`);\n      }\n    } catch (error) {\n      console.error(\"Fetch Error:\", error);\n      alert(\"Failed to save job. Check backend connection.\");\n    }\n  });\n\n  // Make the panel draggable\n  let isDragging = false;\n  let offset = { x: 0, y: 0 };\n\n  container.addEventListener('mousedown', function(e) {\n    if (e.target === container || e.target === header || e.target === closeBtn) {\n      isDragging = true;\n      offset.x = container.offsetLeft - e.clientX;\n      offset.y = container.offsetTop - e.clientY;\n    }\n  });\n\n  document.addEventListener('mouseup', function() {\n    isDragging = false;\n  });\n\n  document.addEventListener('mousemove', function(e) {\n    if (isDragging) {\n      container.style.left = (e.clientX + offset.x) + 'px';\n      container.style.top = (e.clientY + offset.y) + 'px';\n    }\n  });\n}",
        "resume_used": "",
        "date_saved": "2025-02-23 03:10:08",
        "last_update": "2025-02-23 03:10:08"
    }
]